Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb5.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     stm32U5Gx_gtzc1_mpcbb5 equates.
 */

#pragma once

#include    <stdint.h>

// GTZC1_MPCBB5 address definitions
// --------------------------------

typedef struct {
    volatile    uint32_t    CR;
    volatile    uint32_t    RESERVED0[3];
    volatile    uint32_t    CFGLOCK1;
    volatile    uint32_t    CFGLOCK2;
    volatile    uint32_t    RESERVED1[58];
    volatile    uint32_t    SECCFGR0;
    volatile    uint32_t    SECCFGR1;
    volatile    uint32_t    SECCFGR2;
    volatile    uint32_t    SECCFGR3;
    volatile    uint32_t    SECCFGR4;
    volatile    uint32_t    SECCFGR5;
    volatile    uint32_t    SECCFGR6;
    volatile    uint32_t    SECCFGR7;
    volatile    uint32_t    SECCFGR8;
    volatile    uint32_t    SECCFGR9;
    volatile    uint32_t    SECCFGR10;
    volatile    uint32_t    SECCFGR11;
    volatile    uint32_t    SECCFGR12;
    volatile    uint32_t    SECCFGR13;
    volatile    uint32_t    SECCFGR14;
    volatile    uint32_t    SECCFGR15;
    volatile    uint32_t    SECCFGR16;
    volatile    uint32_t    SECCFGR17;
    volatile    uint32_t    SECCFGR18;
    volatile    uint32_t    SECCFGR19;
    volatile    uint32_t    SECCFGR20;
    volatile    uint32_t    SECCFGR21;
    volatile    uint32_t    SECCFGR22;
    volatile    uint32_t    SECCFGR23;
    volatile    uint32_t    SECCFGR24;
    volatile    uint32_t    SECCFGR25;
    volatile    uint32_t    SECCFGR26;
    volatile    uint32_t    SECCFGR27;
    volatile    uint32_t    SECCFGR28;
    volatile    uint32_t    SECCFGR29;
    volatile    uint32_t    SECCFGR30;
    volatile    uint32_t    SECCFGR31;
    volatile    uint32_t    SECCFGR32;
    volatile    uint32_t    SECCFGR33;
    volatile    uint32_t    SECCFGR34;
    volatile    uint32_t    SECCFGR35;
    volatile    uint32_t    SECCFGR36;
    volatile    uint32_t    SECCFGR37;
    volatile    uint32_t    SECCFGR38;
    volatile    uint32_t    SECCFGR39;
    volatile    uint32_t    SECCFGR40;
    volatile    uint32_t    SECCFGR41;
    volatile    uint32_t    SECCFGR42;
    volatile    uint32_t    SECCFGR43;
    volatile    uint32_t    SECCFGR44;
    volatile    uint32_t    SECCFGR45;
    volatile    uint32_t    SECCFGR46;
    volatile    uint32_t    SECCFGR47;
    volatile    uint32_t    SECCFGR48;
    volatile    uint32_t    SECCFGR49;
    volatile    uint32_t    SECCFGR50;
    volatile    uint32_t    SECCFGR51;
    volatile    uint32_t    RESERVED2[12];
    volatile    uint32_t    PRIVCFGR0;
    volatile    uint32_t    PRIVCFGR1;
    volatile    uint32_t    PRIVCFGR2;
    volatile    uint32_t    PRIVCFGR3;
    volatile    uint32_t    PRIVCFGR4;
    volatile    uint32_t    PRIVCFGR5;
    volatile    uint32_t    PRIVCFGR6;
    volatile    uint32_t    PRIVCFGR7;
    volatile    uint32_t    PRIVCFGR8;
    volatile    uint32_t    PRIVCFGR9;
    volatile    uint32_t    PRIVCFGR10;
    volatile    uint32_t    PRIVCFGR11;
    volatile    uint32_t    PRIVCFGR12;
    volatile    uint32_t    PRIVCFGR13;
    volatile    uint32_t    PRIVCFGR14;
    volatile    uint32_t    PRIVCFGR15;
    volatile    uint32_t    PRIVCFGR16;
    volatile    uint32_t    PRIVCFGR17;
    volatile    uint32_t    PRIVCFGR18;
    volatile    uint32_t    PRIVCFGR19;
    volatile    uint32_t    PRIVCFGR20;
    volatile    uint32_t    PRIVCFGR21;
    volatile    uint32_t    PRIVCFGR22;
    volatile    uint32_t    PRIVCFGR23;
    volatile    uint32_t    PRIVCFGR24;
    volatile    uint32_t    PRIVCFGR25;
    volatile    uint32_t    PRIVCFGR26;
    volatile    uint32_t    PRIVCFGR27;
    volatile    uint32_t    PRIVCFGR28;
    volatile    uint32_t    PRIVCFGR29;
    volatile    uint32_t    PRIVCFGR30;
    volatile    uint32_t    PRIVCFGR31;
    volatile    uint32_t    PRIVCFGR32;
    volatile    uint32_t    PRIVCFGR33;
    volatile    uint32_t    PRIVCFGR34;
    volatile    uint32_t    PRIVCFGR35;
    volatile    uint32_t    PRIVCFGR36;
    volatile    uint32_t    PRIVCFGR37;
    volatile    uint32_t    PRIVCFGR38;
    volatile    uint32_t    PRIVCFGR39;
    volatile    uint32_t    PRIVCFGR40;
    volatile    uint32_t    PRIVCFGR41;
    volatile    uint32_t    PRIVCFGR42;
    volatile    uint32_t    PRIVCFGR43;
    volatile    uint32_t    PRIVCFGR44;
    volatile    uint32_t    PRIVCFGR45;
    volatile    uint32_t    PRIVCFGR46;
    volatile    uint32_t    PRIVCFGR47;
    volatile    uint32_t    PRIVCFGR48;
    volatile    uint32_t    PRIVCFGR49;
    volatile    uint32_t    PRIVCFGR50;
    volatile    uint32_t    PRIVCFGR51;
} GTZC1_MPCBB5_TypeDef;

#ifdef __cplusplus
#define GTZC1_MPCBB5_NS reinterpret_cast<GTZC1_MPCBB5_TypeDef *>(0x40033800U)
#define GTZC1_MPCBB5_S  reinterpret_cast<GTZC1_MPCBB5_TypeDef *>(0x50033800U)

#else
#define GTZC1_MPCBB5_NS ((GTZC1_MPCBB5_TypeDef *)0x40033800U)
#define GTZC1_MPCBB5_S  ((GTZC1_MPCBB5_TypeDef *)0x50033800U)
#endif

// CR Configuration

#define GTZC1_MPCBB5_CR_SRWILADIS       (0x1U<<31)
#define GTZC1_MPCBB5_CR_INVSECSTATE     (0x1U<<30)
#define GTZC1_MPCBB5_CR_GLOCK           (0x1U<<0)

// CFGLOCK1 Configuration

#define GTZC1_MPCBB5_CFGLOCK1_SPLCK31   (0x1U<<31)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK30   (0x1U<<30)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK29   (0x1U<<29)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK28   (0x1U<<28)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK27   (0x1U<<27)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK26   (0x1U<<26)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK25   (0x1U<<25)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK24   (0x1U<<24)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK23   (0x1U<<23)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK22   (0x1U<<22)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK21   (0x1U<<21)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK20   (0x1U<<20)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK19   (0x1U<<19)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK18   (0x1U<<18)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK17   (0x1U<<17)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK16   (0x1U<<16)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK15   (0x1U<<15)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK14   (0x1U<<14)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK13   (0x1U<<13)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK12   (0x1U<<12)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK11   (0x1U<<11)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK10   (0x1U<<10)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK9    (0x1U<<9)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK8    (0x1U<<8)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK7    (0x1U<<7)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK6    (0x1U<<6)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK5    (0x1U<<5)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK4    (0x1U<<4)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK3    (0x1U<<3)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK2    (0x1U<<2)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK1    (0x1U<<1)
#define GTZC1_MPCBB5_CFGLOCK1_SPLCK0    (0x1U<<0)

// CFGLOCK2 Configuration

#define GTZC1_MPCBB5_CFGLOCK2_SPLCK51   (0x1U<<19)
#define GTZC1_MPCBB5_CFGLOCK2_SPLCK50   (0x1U<<18)
#define GTZC1_MPCBB5_CFGLOCK2_SPLCK49   (0x1U<<17)
#define GTZC1_MPCBB5_CFGLOCK2_SPLCK48   (0x1U<<16)
#define GTZC1_MPCBB5_CFGLOCK2_SPLCK47   (0x1U<<15)
#define GTZC1_MPCBB5_CFGLOCK2_SPLCK46   (0x1U<<14)
#define GTZC1_MPCBB5_CFGLOCK2_SPLCK45   (0x1U<<13)
#define GTZC1_MPCBB5_CFGLOCK2_SPLCK44   (0x1U<<12)
#define GTZC1_MPCBB5_CFGLOCK2_SPLCK43   (0x1U<<11)
#define GTZC1_MPCBB5_CFGLOCK2_SPLCK42   (0x1U<<10)
#define GTZC1_MPCBB5_CFGLOCK2_SPLCK41   (0x1U<<9)
#define GTZC1_MPCBB5_CFGLOCK2_SPLCK40   (0x1U<<8)
#define GTZC1_MPCBB5_CFGLOCK2_SPLCK39   (0x1U<<7)
#define GTZC1_MPCBB5_CFGLOCK2_SPLCK38   (0x1U<<6)
#define GTZC1_MPCBB5_CFGLOCK2_SPLCK37   (0x1U<<5)
#define GTZC1_MPCBB5_CFGLOCK2_SPLCK36   (0x1U<<4)
#define GTZC1_MPCBB5_CFGLOCK2_SPLCK35   (0x1U<<3)
#define GTZC1_MPCBB5_CFGLOCK2_SPLCK34   (0x1U<<2)
#define GTZC1_MPCBB5_CFGLOCK2_SPLCK33   (0x1U<<1)
#define GTZC1_MPCBB5_CFGLOCK2_SPLCK32   (0x1U<<0)

