Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb5.h
// SECCFGR32 Configuration

#define GTZC1_MPCBB5_SECCFGR32_SEC31    (0x1U<<31)
#define GTZC1_MPCBB5_SECCFGR32_SEC30    (0x1U<<30)
#define GTZC1_MPCBB5_SECCFGR32_SEC29    (0x1U<<29)
#define GTZC1_MPCBB5_SECCFGR32_SEC28    (0x1U<<28)
#define GTZC1_MPCBB5_SECCFGR32_SEC27    (0x1U<<27)
#define GTZC1_MPCBB5_SECCFGR32_SEC26    (0x1U<<26)
#define GTZC1_MPCBB5_SECCFGR32_SEC25    (0x1U<<25)
#define GTZC1_MPCBB5_SECCFGR32_SEC24    (0x1U<<24)
#define GTZC1_MPCBB5_SECCFGR32_SEC23    (0x1U<<23)
#define GTZC1_MPCBB5_SECCFGR32_SEC22    (0x1U<<22)
#define GTZC1_MPCBB5_SECCFGR32_SEC21    (0x1U<<21)
#define GTZC1_MPCBB5_SECCFGR32_SEC20    (0x1U<<20)
#define GTZC1_MPCBB5_SECCFGR32_SEC19    (0x1U<<19)
#define GTZC1_MPCBB5_SECCFGR32_SEC18    (0x1U<<18)
#define GTZC1_MPCBB5_SECCFGR32_SEC17    (0x1U<<17)
#define GTZC1_MPCBB5_SECCFGR32_SEC16    (0x1U<<16)
#define GTZC1_MPCBB5_SECCFGR32_SEC15    (0x1U<<15)
#define GTZC1_MPCBB5_SECCFGR32_SEC14    (0x1U<<14)
#define GTZC1_MPCBB5_SECCFGR32_SEC13    (0x1U<<13)
#define GTZC1_MPCBB5_SECCFGR32_SEC12    (0x1U<<12)
#define GTZC1_MPCBB5_SECCFGR32_SEC11    (0x1U<<11)
#define GTZC1_MPCBB5_SECCFGR32_SEC10    (0x1U<<10)
#define GTZC1_MPCBB5_SECCFGR32_SEC9     (0x1U<<9)
#define GTZC1_MPCBB5_SECCFGR32_SEC8     (0x1U<<8)
#define GTZC1_MPCBB5_SECCFGR32_SEC7     (0x1U<<7)
#define GTZC1_MPCBB5_SECCFGR32_SEC6     (0x1U<<6)
#define GTZC1_MPCBB5_SECCFGR32_SEC5     (0x1U<<5)
#define GTZC1_MPCBB5_SECCFGR32_SEC4     (0x1U<<4)
#define GTZC1_MPCBB5_SECCFGR32_SEC3     (0x1U<<3)
#define GTZC1_MPCBB5_SECCFGR32_SEC2     (0x1U<<2)
#define GTZC1_MPCBB5_SECCFGR32_SEC1     (0x1U<<1)
#define GTZC1_MPCBB5_SECCFGR32_SEC0     (0x1U<<0)

// SECCFGR33 Configuration

#define GTZC1_MPCBB5_SECCFGR33_SEC31    (0x1U<<31)
#define GTZC1_MPCBB5_SECCFGR33_SEC30    (0x1U<<30)
#define GTZC1_MPCBB5_SECCFGR33_SEC29    (0x1U<<29)
#define GTZC1_MPCBB5_SECCFGR33_SEC28    (0x1U<<28)
#define GTZC1_MPCBB5_SECCFGR33_SEC27    (0x1U<<27)
#define GTZC1_MPCBB5_SECCFGR33_SEC26    (0x1U<<26)
#define GTZC1_MPCBB5_SECCFGR33_SEC25    (0x1U<<25)
#define GTZC1_MPCBB5_SECCFGR33_SEC24    (0x1U<<24)
#define GTZC1_MPCBB5_SECCFGR33_SEC23    (0x1U<<23)
#define GTZC1_MPCBB5_SECCFGR33_SEC22    (0x1U<<22)
#define GTZC1_MPCBB5_SECCFGR33_SEC21    (0x1U<<21)
#define GTZC1_MPCBB5_SECCFGR33_SEC20    (0x1U<<20)
#define GTZC1_MPCBB5_SECCFGR33_SEC19    (0x1U<<19)
#define GTZC1_MPCBB5_SECCFGR33_SEC18    (0x1U<<18)
#define GTZC1_MPCBB5_SECCFGR33_SEC17    (0x1U<<17)
#define GTZC1_MPCBB5_SECCFGR33_SEC16    (0x1U<<16)
#define GTZC1_MPCBB5_SECCFGR33_SEC15    (0x1U<<15)
#define GTZC1_MPCBB5_SECCFGR33_SEC14    (0x1U<<14)
#define GTZC1_MPCBB5_SECCFGR33_SEC13    (0x1U<<13)
#define GTZC1_MPCBB5_SECCFGR33_SEC12    (0x1U<<12)
#define GTZC1_MPCBB5_SECCFGR33_SEC11    (0x1U<<11)
#define GTZC1_MPCBB5_SECCFGR33_SEC10    (0x1U<<10)
#define GTZC1_MPCBB5_SECCFGR33_SEC9     (0x1U<<9)
#define GTZC1_MPCBB5_SECCFGR33_SEC8     (0x1U<<8)
#define GTZC1_MPCBB5_SECCFGR33_SEC7     (0x1U<<7)
#define GTZC1_MPCBB5_SECCFGR33_SEC6     (0x1U<<6)
#define GTZC1_MPCBB5_SECCFGR33_SEC5     (0x1U<<5)
#define GTZC1_MPCBB5_SECCFGR33_SEC4     (0x1U<<4)
#define GTZC1_MPCBB5_SECCFGR33_SEC3     (0x1U<<3)
#define GTZC1_MPCBB5_SECCFGR33_SEC2     (0x1U<<2)
#define GTZC1_MPCBB5_SECCFGR33_SEC1     (0x1U<<1)
#define GTZC1_MPCBB5_SECCFGR33_SEC0     (0x1U<<0)

// SECCFGR34 Configuration

#define GTZC1_MPCBB5_SECCFGR34_SEC31    (0x1U<<31)
#define GTZC1_MPCBB5_SECCFGR34_SEC30    (0x1U<<30)
#define GTZC1_MPCBB5_SECCFGR34_SEC29    (0x1U<<29)
#define GTZC1_MPCBB5_SECCFGR34_SEC28    (0x1U<<28)
#define GTZC1_MPCBB5_SECCFGR34_SEC27    (0x1U<<27)
#define GTZC1_MPCBB5_SECCFGR34_SEC26    (0x1U<<26)
#define GTZC1_MPCBB5_SECCFGR34_SEC25    (0x1U<<25)
#define GTZC1_MPCBB5_SECCFGR34_SEC24    (0x1U<<24)
#define GTZC1_MPCBB5_SECCFGR34_SEC23    (0x1U<<23)
#define GTZC1_MPCBB5_SECCFGR34_SEC22    (0x1U<<22)
#define GTZC1_MPCBB5_SECCFGR34_SEC21    (0x1U<<21)
#define GTZC1_MPCBB5_SECCFGR34_SEC20    (0x1U<<20)
#define GTZC1_MPCBB5_SECCFGR34_SEC19    (0x1U<<19)
#define GTZC1_MPCBB5_SECCFGR34_SEC18    (0x1U<<18)
#define GTZC1_MPCBB5_SECCFGR34_SEC17    (0x1U<<17)
#define GTZC1_MPCBB5_SECCFGR34_SEC16    (0x1U<<16)
#define GTZC1_MPCBB5_SECCFGR34_SEC15    (0x1U<<15)
#define GTZC1_MPCBB5_SECCFGR34_SEC14    (0x1U<<14)
#define GTZC1_MPCBB5_SECCFGR34_SEC13    (0x1U<<13)
#define GTZC1_MPCBB5_SECCFGR34_SEC12    (0x1U<<12)
#define GTZC1_MPCBB5_SECCFGR34_SEC11    (0x1U<<11)
#define GTZC1_MPCBB5_SECCFGR34_SEC10    (0x1U<<10)
#define GTZC1_MPCBB5_SECCFGR34_SEC9     (0x1U<<9)
#define GTZC1_MPCBB5_SECCFGR34_SEC8     (0x1U<<8)
#define GTZC1_MPCBB5_SECCFGR34_SEC7     (0x1U<<7)
#define GTZC1_MPCBB5_SECCFGR34_SEC6     (0x1U<<6)
#define GTZC1_MPCBB5_SECCFGR34_SEC5     (0x1U<<5)
#define GTZC1_MPCBB5_SECCFGR34_SEC4     (0x1U<<4)
#define GTZC1_MPCBB5_SECCFGR34_SEC3     (0x1U<<3)
#define GTZC1_MPCBB5_SECCFGR34_SEC2     (0x1U<<2)
#define GTZC1_MPCBB5_SECCFGR34_SEC1     (0x1U<<1)
#define GTZC1_MPCBB5_SECCFGR34_SEC0     (0x1U<<0)

// SECCFGR35 Configuration

#define GTZC1_MPCBB5_SECCFGR35_SEC31    (0x1U<<31)
#define GTZC1_MPCBB5_SECCFGR35_SEC30    (0x1U<<30)
#define GTZC1_MPCBB5_SECCFGR35_SEC29    (0x1U<<29)
#define GTZC1_MPCBB5_SECCFGR35_SEC28    (0x1U<<28)
#define GTZC1_MPCBB5_SECCFGR35_SEC27    (0x1U<<27)
#define GTZC1_MPCBB5_SECCFGR35_SEC26    (0x1U<<26)
#define GTZC1_MPCBB5_SECCFGR35_SEC25    (0x1U<<25)
#define GTZC1_MPCBB5_SECCFGR35_SEC24    (0x1U<<24)
#define GTZC1_MPCBB5_SECCFGR35_SEC23    (0x1U<<23)
#define GTZC1_MPCBB5_SECCFGR35_SEC22    (0x1U<<22)
#define GTZC1_MPCBB5_SECCFGR35_SEC21    (0x1U<<21)
#define GTZC1_MPCBB5_SECCFGR35_SEC20    (0x1U<<20)
#define GTZC1_MPCBB5_SECCFGR35_SEC19    (0x1U<<19)
#define GTZC1_MPCBB5_SECCFGR35_SEC18    (0x1U<<18)
#define GTZC1_MPCBB5_SECCFGR35_SEC17    (0x1U<<17)
#define GTZC1_MPCBB5_SECCFGR35_SEC16    (0x1U<<16)
#define GTZC1_MPCBB5_SECCFGR35_SEC15    (0x1U<<15)
#define GTZC1_MPCBB5_SECCFGR35_SEC14    (0x1U<<14)
#define GTZC1_MPCBB5_SECCFGR35_SEC13    (0x1U<<13)
#define GTZC1_MPCBB5_SECCFGR35_SEC12    (0x1U<<12)
#define GTZC1_MPCBB5_SECCFGR35_SEC11    (0x1U<<11)
#define GTZC1_MPCBB5_SECCFGR35_SEC10    (0x1U<<10)
#define GTZC1_MPCBB5_SECCFGR35_SEC9     (0x1U<<9)
#define GTZC1_MPCBB5_SECCFGR35_SEC8     (0x1U<<8)
#define GTZC1_MPCBB5_SECCFGR35_SEC7     (0x1U<<7)
#define GTZC1_MPCBB5_SECCFGR35_SEC6     (0x1U<<6)
#define GTZC1_MPCBB5_SECCFGR35_SEC5     (0x1U<<5)
#define GTZC1_MPCBB5_SECCFGR35_SEC4     (0x1U<<4)
#define GTZC1_MPCBB5_SECCFGR35_SEC3     (0x1U<<3)
#define GTZC1_MPCBB5_SECCFGR35_SEC2     (0x1U<<2)
#define GTZC1_MPCBB5_SECCFGR35_SEC1     (0x1U<<1)
#define GTZC1_MPCBB5_SECCFGR35_SEC0     (0x1U<<0)

// SECCFGR36 Configuration

#define GTZC1_MPCBB5_SECCFGR36_SEC31    (0x1U<<31)
#define GTZC1_MPCBB5_SECCFGR36_SEC30    (0x1U<<30)
#define GTZC1_MPCBB5_SECCFGR36_SEC29    (0x1U<<29)
#define GTZC1_MPCBB5_SECCFGR36_SEC28    (0x1U<<28)
#define GTZC1_MPCBB5_SECCFGR36_SEC27    (0x1U<<27)
#define GTZC1_MPCBB5_SECCFGR36_SEC26    (0x1U<<26)
#define GTZC1_MPCBB5_SECCFGR36_SEC25    (0x1U<<25)
#define GTZC1_MPCBB5_SECCFGR36_SEC24    (0x1U<<24)
#define GTZC1_MPCBB5_SECCFGR36_SEC23    (0x1U<<23)
#define GTZC1_MPCBB5_SECCFGR36_SEC22    (0x1U<<22)
#define GTZC1_MPCBB5_SECCFGR36_SEC21    (0x1U<<21)
#define GTZC1_MPCBB5_SECCFGR36_SEC20    (0x1U<<20)
#define GTZC1_MPCBB5_SECCFGR36_SEC19    (0x1U<<19)
#define GTZC1_MPCBB5_SECCFGR36_SEC18    (0x1U<<18)
#define GTZC1_MPCBB5_SECCFGR36_SEC17    (0x1U<<17)
#define GTZC1_MPCBB5_SECCFGR36_SEC16    (0x1U<<16)
#define GTZC1_MPCBB5_SECCFGR36_SEC15    (0x1U<<15)
#define GTZC1_MPCBB5_SECCFGR36_SEC14    (0x1U<<14)
#define GTZC1_MPCBB5_SECCFGR36_SEC13    (0x1U<<13)
#define GTZC1_MPCBB5_SECCFGR36_SEC12    (0x1U<<12)
#define GTZC1_MPCBB5_SECCFGR36_SEC11    (0x1U<<11)
#define GTZC1_MPCBB5_SECCFGR36_SEC10    (0x1U<<10)
#define GTZC1_MPCBB5_SECCFGR36_SEC9     (0x1U<<9)
#define GTZC1_MPCBB5_SECCFGR36_SEC8     (0x1U<<8)
#define GTZC1_MPCBB5_SECCFGR36_SEC7     (0x1U<<7)
#define GTZC1_MPCBB5_SECCFGR36_SEC6     (0x1U<<6)
#define GTZC1_MPCBB5_SECCFGR36_SEC5     (0x1U<<5)
#define GTZC1_MPCBB5_SECCFGR36_SEC4     (0x1U<<4)
#define GTZC1_MPCBB5_SECCFGR36_SEC3     (0x1U<<3)
#define GTZC1_MPCBB5_SECCFGR36_SEC2     (0x1U<<2)
#define GTZC1_MPCBB5_SECCFGR36_SEC1     (0x1U<<1)
#define GTZC1_MPCBB5_SECCFGR36_SEC0     (0x1U<<0)

// SECCFGR37 Configuration

#define GTZC1_MPCBB5_SECCFGR37_SEC31    (0x1U<<31)
#define GTZC1_MPCBB5_SECCFGR37_SEC30    (0x1U<<30)
#define GTZC1_MPCBB5_SECCFGR37_SEC29    (0x1U<<29)
#define GTZC1_MPCBB5_SECCFGR37_SEC28    (0x1U<<28)
#define GTZC1_MPCBB5_SECCFGR37_SEC27    (0x1U<<27)
#define GTZC1_MPCBB5_SECCFGR37_SEC26    (0x1U<<26)
#define GTZC1_MPCBB5_SECCFGR37_SEC25    (0x1U<<25)
#define GTZC1_MPCBB5_SECCFGR37_SEC24    (0x1U<<24)
#define GTZC1_MPCBB5_SECCFGR37_SEC23    (0x1U<<23)
#define GTZC1_MPCBB5_SECCFGR37_SEC22    (0x1U<<22)
#define GTZC1_MPCBB5_SECCFGR37_SEC21    (0x1U<<21)
#define GTZC1_MPCBB5_SECCFGR37_SEC20    (0x1U<<20)
#define GTZC1_MPCBB5_SECCFGR37_SEC19    (0x1U<<19)
#define GTZC1_MPCBB5_SECCFGR37_SEC18    (0x1U<<18)
#define GTZC1_MPCBB5_SECCFGR37_SEC17    (0x1U<<17)
#define GTZC1_MPCBB5_SECCFGR37_SEC16    (0x1U<<16)
#define GTZC1_MPCBB5_SECCFGR37_SEC15    (0x1U<<15)
#define GTZC1_MPCBB5_SECCFGR37_SEC14    (0x1U<<14)
#define GTZC1_MPCBB5_SECCFGR37_SEC13    (0x1U<<13)
#define GTZC1_MPCBB5_SECCFGR37_SEC12    (0x1U<<12)
#define GTZC1_MPCBB5_SECCFGR37_SEC11    (0x1U<<11)
#define GTZC1_MPCBB5_SECCFGR37_SEC10    (0x1U<<10)
#define GTZC1_MPCBB5_SECCFGR37_SEC9     (0x1U<<9)
#define GTZC1_MPCBB5_SECCFGR37_SEC8     (0x1U<<8)
#define GTZC1_MPCBB5_SECCFGR37_SEC7     (0x1U<<7)
#define GTZC1_MPCBB5_SECCFGR37_SEC6     (0x1U<<6)
#define GTZC1_MPCBB5_SECCFGR37_SEC5     (0x1U<<5)
#define GTZC1_MPCBB5_SECCFGR37_SEC4     (0x1U<<4)
#define GTZC1_MPCBB5_SECCFGR37_SEC3     (0x1U<<3)
#define GTZC1_MPCBB5_SECCFGR37_SEC2     (0x1U<<2)
#define GTZC1_MPCBB5_SECCFGR37_SEC1     (0x1U<<1)
#define GTZC1_MPCBB5_SECCFGR37_SEC0     (0x1U<<0)

// SECCFGR38 Configuration

#define GTZC1_MPCBB5_SECCFGR38_SEC31    (0x1U<<31)
#define GTZC1_MPCBB5_SECCFGR38_SEC30    (0x1U<<30)
#define GTZC1_MPCBB5_SECCFGR38_SEC29    (0x1U<<29)
#define GTZC1_MPCBB5_SECCFGR38_SEC28    (0x1U<<28)
#define GTZC1_MPCBB5_SECCFGR38_SEC27    (0x1U<<27)
#define GTZC1_MPCBB5_SECCFGR38_SEC26    (0x1U<<26)
#define GTZC1_MPCBB5_SECCFGR38_SEC25    (0x1U<<25)
#define GTZC1_MPCBB5_SECCFGR38_SEC24    (0x1U<<24)
#define GTZC1_MPCBB5_SECCFGR38_SEC23    (0x1U<<23)
#define GTZC1_MPCBB5_SECCFGR38_SEC22    (0x1U<<22)
#define GTZC1_MPCBB5_SECCFGR38_SEC21    (0x1U<<21)
#define GTZC1_MPCBB5_SECCFGR38_SEC20    (0x1U<<20)
#define GTZC1_MPCBB5_SECCFGR38_SEC19    (0x1U<<19)
#define GTZC1_MPCBB5_SECCFGR38_SEC18    (0x1U<<18)
#define GTZC1_MPCBB5_SECCFGR38_SEC17    (0x1U<<17)
#define GTZC1_MPCBB5_SECCFGR38_SEC16    (0x1U<<16)
#define GTZC1_MPCBB5_SECCFGR38_SEC15    (0x1U<<15)
#define GTZC1_MPCBB5_SECCFGR38_SEC14    (0x1U<<14)
#define GTZC1_MPCBB5_SECCFGR38_SEC13    (0x1U<<13)
#define GTZC1_MPCBB5_SECCFGR38_SEC12    (0x1U<<12)
#define GTZC1_MPCBB5_SECCFGR38_SEC11    (0x1U<<11)
#define GTZC1_MPCBB5_SECCFGR38_SEC10    (0x1U<<10)
#define GTZC1_MPCBB5_SECCFGR38_SEC9     (0x1U<<9)
#define GTZC1_MPCBB5_SECCFGR38_SEC8     (0x1U<<8)
#define GTZC1_MPCBB5_SECCFGR38_SEC7     (0x1U<<7)
#define GTZC1_MPCBB5_SECCFGR38_SEC6     (0x1U<<6)
#define GTZC1_MPCBB5_SECCFGR38_SEC5     (0x1U<<5)
#define GTZC1_MPCBB5_SECCFGR38_SEC4     (0x1U<<4)
#define GTZC1_MPCBB5_SECCFGR38_SEC3     (0x1U<<3)
#define GTZC1_MPCBB5_SECCFGR38_SEC2     (0x1U<<2)
#define GTZC1_MPCBB5_SECCFGR38_SEC1     (0x1U<<1)
#define GTZC1_MPCBB5_SECCFGR38_SEC0     (0x1U<<0)

// SECCFGR39 Configuration

#define GTZC1_MPCBB5_SECCFGR39_SEC31    (0x1U<<31)
#define GTZC1_MPCBB5_SECCFGR39_SEC30    (0x1U<<30)
#define GTZC1_MPCBB5_SECCFGR39_SEC29    (0x1U<<29)
#define GTZC1_MPCBB5_SECCFGR39_SEC28    (0x1U<<28)
#define GTZC1_MPCBB5_SECCFGR39_SEC27    (0x1U<<27)
#define GTZC1_MPCBB5_SECCFGR39_SEC26    (0x1U<<26)
#define GTZC1_MPCBB5_SECCFGR39_SEC25    (0x1U<<25)
#define GTZC1_MPCBB5_SECCFGR39_SEC24    (0x1U<<24)
#define GTZC1_MPCBB5_SECCFGR39_SEC23    (0x1U<<23)
#define GTZC1_MPCBB5_SECCFGR39_SEC22    (0x1U<<22)
#define GTZC1_MPCBB5_SECCFGR39_SEC21    (0x1U<<21)
#define GTZC1_MPCBB5_SECCFGR39_SEC20    (0x1U<<20)
#define GTZC1_MPCBB5_SECCFGR39_SEC19    (0x1U<<19)
#define GTZC1_MPCBB5_SECCFGR39_SEC18    (0x1U<<18)
#define GTZC1_MPCBB5_SECCFGR39_SEC17    (0x1U<<17)
#define GTZC1_MPCBB5_SECCFGR39_SEC16    (0x1U<<16)
#define GTZC1_MPCBB5_SECCFGR39_SEC15    (0x1U<<15)
#define GTZC1_MPCBB5_SECCFGR39_SEC14    (0x1U<<14)
#define GTZC1_MPCBB5_SECCFGR39_SEC13    (0x1U<<13)
#define GTZC1_MPCBB5_SECCFGR39_SEC12    (0x1U<<12)
#define GTZC1_MPCBB5_SECCFGR39_SEC11    (0x1U<<11)
#define GTZC1_MPCBB5_SECCFGR39_SEC10    (0x1U<<10)
#define GTZC1_MPCBB5_SECCFGR39_SEC9     (0x1U<<9)
#define GTZC1_MPCBB5_SECCFGR39_SEC8     (0x1U<<8)
#define GTZC1_MPCBB5_SECCFGR39_SEC7     (0x1U<<7)
#define GTZC1_MPCBB5_SECCFGR39_SEC6     (0x1U<<6)
#define GTZC1_MPCBB5_SECCFGR39_SEC5     (0x1U<<5)
#define GTZC1_MPCBB5_SECCFGR39_SEC4     (0x1U<<4)
#define GTZC1_MPCBB5_SECCFGR39_SEC3     (0x1U<<3)
#define GTZC1_MPCBB5_SECCFGR39_SEC2     (0x1U<<2)
#define GTZC1_MPCBB5_SECCFGR39_SEC1     (0x1U<<1)
#define GTZC1_MPCBB5_SECCFGR39_SEC0     (0x1U<<0)

