Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb5.h
// PRIVCFGR28 Configuration

#define GTZC1_MPCBB5_PRIVCFGR28_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB5_PRIVCFGR28_PRIV0   (0x1U<<0)

// PRIVCFGR29 Configuration

#define GTZC1_MPCBB5_PRIVCFGR29_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB5_PRIVCFGR29_PRIV0   (0x1U<<0)

// PRIVCFGR30 Configuration

#define GTZC1_MPCBB5_PRIVCFGR30_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB5_PRIVCFGR30_PRIV0   (0x1U<<0)

// PRIVCFGR31 Configuration

#define GTZC1_MPCBB5_PRIVCFGR31_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB5_PRIVCFGR31_PRIV0   (0x1U<<0)

// PRIVCFGR32 Configuration

#define GTZC1_MPCBB5_PRIVCFGR32_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB5_PRIVCFGR32_PRIV0   (0x1U<<0)

// PRIVCFGR33 Configuration

#define GTZC1_MPCBB5_PRIVCFGR33_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB5_PRIVCFGR33_PRIV0   (0x1U<<0)

// PRIVCFGR34 Configuration

#define GTZC1_MPCBB5_PRIVCFGR34_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB5_PRIVCFGR34_PRIV0   (0x1U<<0)

// PRIVCFGR35 Configuration

