Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb5.h
// PRIVCFGR44 Configuration

#define GTZC1_MPCBB5_PRIVCFGR44_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB5_PRIVCFGR44_PRIV0   (0x1U<<0)

// PRIVCFGR45 Configuration

#define GTZC1_MPCBB5_PRIVCFGR45_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB5_PRIVCFGR45_PRIV0   (0x1U<<0)

// PRIVCFGR46 Configuration

#define GTZC1_MPCBB5_PRIVCFGR46_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB5_PRIVCFGR46_PRIV0   (0x1U<<0)

// PRIVCFGR47 Configuration

#define GTZC1_MPCBB5_PRIVCFGR47_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB5_PRIVCFGR47_PRIV0   (0x1U<<0)

